{
  "metadata": {
    "responseInfo": {
      "status": 200,
      "developerMessage": "OK"
    }
  },
  "pages": [
    {
      "name": "Ukraine",
      "capital": "Kyiv",
      "currency": "hryvnia ₴ (UAH)",
      "population": "33,200,000",
      "shortDescription": " Ukraine is a country in Eastern Europe. It is the second-largest European country after Russia, which borders it to the east and northeast. It also borders Belarus to the north; Poland, Slovakia, and Hungary to the west; and Romania and Moldova to the southwest; with a coastline along the Black Sea and the Sea of Azov to the south and southeast. Kyiv is the nation's capital and largest city, followed by Kharkiv, Dnipro and Odesa. Ukraine's official language is Ukrainian; Russian is also widely spoken, especially in the east and south. \\n During the Middle Ages, Ukraine was the site of early Slavic expansion and the area later became a key centre of East Slavic culture under the state of Kievan Rus', which emerged in the 9th century. The state eventually disintegrated into rival regional powers and was ultimately destroyed by the Mongol invasions of the 13th century. The area was then contested, divided, and ruled by a variety of external powers for the next 600 years, including the Polish–Lithuanian Commonwealth, the Austrian Empire, the Ottoman Empire, and the Tsardom of Russia. The Cossack Hetmanate emerged in central Ukraine in the 17th century marked on maps as \"Ukraine, land of the Cossacks\", but was partitioned between Russia and Poland, and ultimately absorbed by the Russian Empire. Ukrainian nationalism developed and, following the Russian Revolution in 1917, the short-lived Ukrainian People's Republic was formed. The Bolsheviks consolidated control over much of the former empire and established the Ukrainian Soviet Socialist Republic, which became a constituent republic of the Soviet Union when it was formed in 1922. In the early 1930s, millions of Ukrainians died in the Holodomor, a human-made famine. The German occupation during World War II in Ukraine was devastating, with 7 million Ukrainian civilians killed, including most Ukrainian Jews. \\n Ukraine gained independence in 1991 as the Soviet Union dissolved, and declared itself neutral. A new constitution was adopted in 1996. A series of mass demonstrations, known as the Euromaidan, led to the establishment of a new government in 2014 after a revolution. Russia then unilaterally annexed Ukraine's Crimean Peninsula, and pro-Russian unrest culminated in a war in the Donbas between Russian-backed separatists and government forces in eastern Ukraine. Russia launched a full-scale invasion of Ukraine in 2022. Since the outbreak of war with Russia, Ukraine has continued to seek closer ties with the United States, European Union, and NATO. \\n Ukraine is a unitary state and its system of government is a semi-presidential republic. A developing country, it is the poorest country in Europe by nominal GDP per capita and corruption remains a significant issue. However, due to its extensive fertile land, pre-war Ukraine was one of the largest grain exporters in the world. It is a founding member of the United Nations, as well as a member of the Council of Europe, the World Trade Organization, and the OSCE. It is in the process of joining the European Union and has applied to join NATO."
    },
    {
      "name": "England",
      "capital": "London",
      "currency": "pound sterling (GBP; £)",
      "population": "57,106,398",
      "shortDescription": "England is a country that is part of the United Kingdom. The country is located on the island of Great Britain, of which it covers roughly 62%, and over 100 smaller adjacent islands. It has land borders with Scotland to the north and Wales to the west, and is otherwise surrounded by the North Sea to the east, the English Channel to the south, the Celtic Sea to the south-west, and the Irish sea to the west. Continental Europe lies to the south-east, and Ireland to the west. The population was 56,490,048 at the 2021 census. London is both the largest city and the capital. \\n The area now called England was first inhabited by modern humans during the Upper Paleolithic, but takes its name from the Angles, a Germanic tribe who settled during the 5th and 6th centuries. England became a unified state in the 10th century and has had a significant cultural and legal impact on the wider world since the Age of Discovery, which began during the 15th century. The Kingdom of England, which included Wales after 1535, ceased being a separate sovereign state on 1 May 1707 when the Acts of Union put the terms agreed in the Treaty of Union the previous year into effect; this resulted in a political union with the Kingdom of Scotland that created the Kingdom of Great Britain. \\n England is the origin of many well-known worldwide exports, including the English language, the English legal system (which served as the basis for the common law systems of many other countries), association football, and the Church of England; its parliamentary system of government has been widely adopted by other nations. The Industrial Revolution began in 18th-century England, transforming its society into the world's first industrialised nation. England is home to the two oldest universities in the English-speaking world: the University of Oxford, founded in 1096, and the University of Cambridge, founded in 1209. Both universities are ranked among the most prestigious in the world. \\n England's terrain chiefly consists of low hills and plains, especially in the centre and south. Upland and mountainous terrain is mostly found in the north and west, including Dartmoor, the Lake District, the Pennines, and the Shropshire Hills. The country's capital is London, the greater metropolitan of which has a population of 14.2 million as of 2021, representing the United Kingdom's largest metropolitan area. England's population of 56.3 million comprises 84% of the population of the United Kingdom, largely concentrated around London, the South East, and conurbations in the Midlands, the North West, the North East, and Yorkshire, which each developed as major industrial regions during the 19th century."
    },
    {
      "name": "United States of America",
      "capital": "Washington, D.C",
      "currency": "U.S. dollar $ (USD)",
      "population": "334,914,895",
      "shortDescription": "The United States of America (USA or U.S.A.), commonly known as the United States (US or U.S.) or America, is a country primarily located in North America. It is a federation of 50 states, a federal capital district (Washington, D.C.), and 326 Indian reservations. Outside the union of states, it asserts sovereignty over five major unincorporated island territories and various uninhabited islands. The country has the world's third-largest land area, second-largest exclusive economic zone, and third-largest population, exceeding 334 million. \\n Paleo-Indians migrated across the Bering land bridge more than 12,000 years ago. British colonization led to the first settlement of the Thirteen Colonies in Virginia in 1607. Clashes with the British Crown over taxation and political representation sparked the American Revolution, with the Second Continental Congress formally declaring independence on July 4, 1776. Following its victory in the Revolutionary War (1775–1783), the country continued to expand across North America. As more states were admitted, sectional division over slavery led to the secession of the Confederate States of America, which fought the remaining states of the Union during the 1861–1865 American Civil War. With the Union's victory and preservation, slavery was abolished nationally. By 1890, the United States had established itself as a great power. After Japan's attack on Pearl Harbor in December 1941, the U.S. entered World War II. The aftermath of the war left the U.S. and the Soviet Union as the world's two superpowers and led to the Cold War, during which both countries engaged in a struggle for ideological dominance and international influence. Following the Soviet Union's collapse and the end of the Cold War in 1991, the U.S. emerged as the world's sole superpower. \\n The U.S. national government is a presidential constitutional republic and liberal democracy with three separate branches: legislative, executive, and judicial. It has a bicameral national legislature composed of the House of Representatives, a lower house based on population; and the Senate, an upper house based on equal representation for each state. Substantial autonomy is given to states and several territories, with a political culture that emphasizes liberty, equality under the law, individualism, and limited government. \\n One of the world's most developed countries, the United States has had the largest nominal GDP since 1890 and accounted for 15% of the global economy in 2023. It possesses by far the largest amount of wealth of any country and the highest median income per capita of any non-microstate. The U.S. ranks among the world's highest in economic competitiveness, productivity, innovation, human rights, and higher education. Its hard power and cultural influence have a global reach. The U.S. is a founding member of the World Bank, IMF, Organization of American States, NATO, World Health Organization, and a permanent member of the UN Security Council."
    },
    {
      "name": "Australia",
      "capital": "Canberra",
      "currency": "Australian dollar $ (AUD)",
      "population": "27,135,100",
      "shortDescription": "Australia, officially the Commonwealth of Australia, is a sovereign country comprising the mainland of the Australian continent, the island of Tasmania, and numerous smaller islands. Australia is the largest country by area in Oceania and the world's sixth-largest country. Australia is the oldest, flattest, and driest inhabited continent, with the least fertile soils. It is a megadiverse country, and its size gives it a wide variety of landscapes and climates, with deserts in the centre, tropical rainforests in the north-east, tropical savannas in the north, and mountain ranges in the south-east. \\n The ancestors of Aboriginal Australians began arriving from south-east Asia 50,000 to 65,000 years ago, during the last glacial period. They settled the continent and had formed approximately 250 distinct language groups by the time of European settlement, maintaining some of the longest known continuing artistic and religious traditions in the world. Australia's written history commenced with European maritime exploration. The Dutch were the first known Europeans to reach Australia, in 1606. British colonisation began in 1788 with the establishment of the penal colony of New South Wales. By the mid-19th century, most of the continent had been explored by European settlers and five additional self-governing British colonies were established, each gaining responsible government by 1890. The colonies federated in 1901, forming the Commonwealth of Australia. This continued a process of increasing autonomy from the United Kingdom, highlighted by the Statute of Westminster Adoption Act 1942, and culminating in the Australia Acts of 1986. \\n Australia is a federal parliamentary constitutional monarchy comprising six states and ten territories: the states of New South Wales, Victoria, Queensland, Tasmania, South Australia and Western Australia; the major mainland Australian Capital Territory and Northern Territory; and other minor or external territories. Its population of nearly 27 million is highly urbanised and heavily concentrated on the eastern seaboard. Canberra is the nation's capital, while its most populous cities are Sydney, Melbourne, Brisbane, Perth and Adelaide. Australian governments have promoted multiculturalism since the 1970s. Australia is culturally diverse and has one of the highest foreign-born populations in the world. Its abundant natural resources and well-developed international trade relations are crucial to the country's economy, which generates its income from various sources: predominantly services (including banking, real estate and international education) as well as mining, manufacturing and agriculture. It ranks highly for quality of life, health, education, economic freedom, civil liberties and political rights. \\n Australia has a highly developed market economy and one of the highest per capita incomes globally. It is a middle power, and has the world's thirteenth-highest military expenditure. It is a member of international groups including the United Nations; the G20; the OECD; the World Trade Organization; Asia-Pacific Economic Cooperation; the Pacific Islands Forum; the Pacific Community; the Commonwealth of Nations; and the defence and security organisations ANZUS, AUKUS, and the Five Eyes. It is also a major non-NATO ally of the United States."
    },
    {
      "name": "Japan",
      "capital": "Tokyo",
      "currency": "Australian dollar $ (AUD)",
      "population": "27,135,100",
      "shortDescription": "Australia, officially the Commonwealth of Australia, is a sovereign country comprising the mainland of the Australian continent, the island of Tasmania, and numerous smaller islands. Australia is the largest country by area in Oceania and the world's sixth-largest country. Australia is the oldest, flattest, and driest inhabited continent, with the least fertile soils. It is a megadiverse country, and its size gives it a wide variety of landscapes and climates, with deserts in the centre, tropical rainforests in the north-east, tropical savannas in the north, and mountain ranges in the south-east. \\n The ancestors of Aboriginal Australians began arriving from south-east Asia 50,000 to 65,000 years ago, during the last glacial period. They settled the continent and had formed approximately 250 distinct language groups by the time of European settlement, maintaining some of the longest known continuing artistic and religious traditions in the world. Australia's written history commenced with European maritime exploration. The Dutch were the first known Europeans to reach Australia, in 1606. British colonisation began in 1788 with the establishment of the penal colony of New South Wales. By the mid-19th century, most of the continent had been explored by European settlers and five additional self-governing British colonies were established, each gaining responsible government by 1890. The colonies federated in 1901, forming the Commonwealth of Australia. This continued a process of increasing autonomy from the United Kingdom, highlighted by the Statute of Westminster Adoption Act 1942, and culminating in the Australia Acts of 1986. \\n Australia is a federal parliamentary constitutional monarchy comprising six states and ten territories: the states of New South Wales, Victoria, Queensland, Tasmania, South Australia and Western Australia; the major mainland Australian Capital Territory and Northern Territory; and other minor or external territories. Its population of nearly 27 million is highly urbanised and heavily concentrated on the eastern seaboard. Canberra is the nation's capital, while its most populous cities are Sydney, Melbourne, Brisbane, Perth and Adelaide. Australian governments have promoted multiculturalism since the 1970s. Australia is culturally diverse and has one of the highest foreign-born populations in the world. Its abundant natural resources and well-developed international trade relations are crucial to the country's economy, which generates its income from various sources: predominantly services (including banking, real estate and international education) as well as mining, manufacturing and agriculture. It ranks highly for quality of life, health, education, economic freedom, civil liberties and political rights. \\n Australia has a highly developed market economy and one of the highest per capita incomes globally. It is a middle power, and has the world's thirteenth-highest military expenditure. It is a member of international groups including the United Nations; the G20; the OECD; the World Trade Organization; Asia-Pacific Economic Cooperation; the Pacific Islands Forum; the Pacific Community; the Commonwealth of Nations; and the defence and security organisations ANZUS, AUKUS, and the Five Eyes. It is also a major non-NATO ally of the United States."
    }
  ]
}